{
  "posts": [
    {
      "title": "Docker is the beest",
      "source": "docker.com",
      "author": "Docker Whaleman",
      "preview": "I think docker is the bestest thing ever.  Isn't it great how there are whales everywhree?",
      "date": "10 days ago",
      "read": "10 min",
      "like": false,
      "folder": "Home"
    },
    {
      "title": "Bats are cool is the beest",
      "source": "batman.com",
      "author": "Alfred Pennyworth",
      "preview": "Bats are cool too.  Says the man that jumps from roof tops fighting crime as a means of coping with the loss of his parents.  As the batman movie characterizes, he has an unquellable rage for criminals and has a hatred for guns.  However, he did threaten to use one that one time.  Shortly after, he hung up his cape. I think docker is the bestest thing ever.  Isn't it great how there are whales everywhree?",
      "date": "371 days ago",
      "read": "78 min",
      "like": false,
      "folder": "Home"
    },
    {
      "title": "Vagrant is also here is the beest",
      "source": "vagrant.com",
      "author": "Vagrabnt Whaleman",
      "preview": "I think docker is the bestest thing ever well except for vagrant which is totally super awesome as well.  Devops is everywhere now isn't it?  I've of this ansible thing but apparently it's quite difficult/annoying to use or something along those lines.  Isn't it great how there are whales everywhree?",
      "date": "98 days ago",
      "read": "56 min",
      "like": false,
      "folder": "Home"
    },
    {
      "title": "Amazing",
      "source": "amzaingness.ca",
      "author": "amazing man",
      "preview": "Isn't it cool how things are amazing sometimes.  LIke really amazing.  Both amazing things are good and bad.  Amazing times abound.  Someimtes the sky is blue.  Do you know why?  It's because of rayleigh scattering.  I think that's he reason.  The premise of what I just said is probalby not entirely correct however.  It's amazing how the memory fades.  For some people, I hear, it isn't quite like that.  I guess that's both fortunate and unfortunate as with nearly everything. Can you believe it, twitter doesn't seem to have much an idea as to what it wants to be.  It has been around forever too.  It's a fantastic way for celebrities and famous people of sorts to communicate with the public in a rather direct fashion.",
      "date": "9765 days ago",
      "read": "5 min",
      "like": false,
      "folder": "Home"
    },
    {
      "title": "Spectacular",
      "source": "spectarularspidersapm",
      "author": "Petoria Parkaria",
      "preview": "All those closes are abound.  They becomes zombies.  I end up making a zombie apocalypse happening.",
      "date": "365 days from now",
      "read": "1 min",
      "like": false,
      "folder": "Home"
    }

  ]
}
